{
  "projects": [
    {
      "id": "1",
      "title": "Signals Master",
      "summary": "A web application for cadets, military personnel, and enthusiasts to hone on their signal flags knowledge.",
      "detailedSummary": "Signals Master is an interactive learning platform designed to help cadets, military personnel, and signal communication enthusiasts master the art of flag semaphore and other signal systems. Built with Ionic and Angular, the app provides an immersive training experience with real-time feedback, progress tracking, and comprehensive learning modules. Deployed on Firebase for reliable hosting and real-time data synchronization.",
      "startDate": "2024-11-22",
      "expectedEndDate": "2025-01-04",
      "status": "in-progress",
      "technologies": [
        "Ionic",
        "Angular",
        "Firebase"
      ],
      "repository": "https://github.com/mjsamaha/SignalsMaster",
      "liveUrl": "https://signalsmaster-40d2f.web.app/tabs/home",
      "devlogPosts": [
        {
          "id": "pre-alpha-v01",
          "title": "Pre-Alpha v0.1 Launch - Core Features & Haptic Feedback",
          "date": "2025-11-25",
          "excerpt": "First experimental release focused on nailing the core quiz mechanics and adding engaging feedback systems with haptic and sound cues.",
          "content": "Pre-Alpha v0.1 is here! This is our first experimental release focused on nailing the core quiz mechanics and adding engaging feedback systems.\n\nNew Haptic & Sound Feedback: You'll now get subtle haptic vibrations and sound cues when you answer correctly or build a streak. It's incredibly satisfying to feel your phone buzz as you dominate a quiz session. The feedback makes the experience more immersive and helps you know instantly when you're on fire.\n\nInteractive Flags Reference Page: Added a comprehensive reference page where you can study all the maritime flags before jumping into competition mode. Great for last-minute cramming or refreshing your memory on specific flags you're struggling with.\n\nSave Button for Competition Mode: Life happens - now you can pause the timer mid-quiz without losing your progress or affecting your accuracy score. Perfect for when someone interrupts you or you need a quick break.\n\nQuiz Flow Improvements: Smoothed out transitions between questions to reduce friction. The experience feels more fluid and natural now.\n\nKnown Issues: Mobile scrolling needs optimization - it's sluggish on some devices. Some UI elements don't scale properly on smaller screens yet. Haptic and sound feedback intensity may vary by device, so we're still fine-tuning those settings.\n\nThis is Pre-Alpha territory - everything is experimental and we're counting on user feedback to shape the final product. Right now, we're laser-focused on getting the fundamentals right before adding more advanced features. The core mechanics are solid, and the interactive elements are making the learning experience much more engaging!",
          "tags": [
            "milestone",
            "feature"
          ],
          "status": "published",
          "images": []
        },
        {
          "id": "pre-alpha-v02",
          "title": "Pre-Alpha v0.2 Release - Major Mobile UX Overhaul",
          "date": "2025-12-01",
          "excerpt": "Comprehensive UI improvements across the entire app to make Signals Master truly mobile-friendly with streamlined layouts and infinite scrolling leaderboards.",
          "content": "Excited to announce Pre-Alpha v0.2! This release focuses on making Signals Master truly mobile-friendly with comprehensive UI improvements across the entire app.\n\nHome Page Refresh: Streamlined the layout for better mobile viewing. All buttons and cards are now more compact and easier to navigate on smaller screens.\n\nPractice Mode Cleanup: Removed repetitive instructions and reorganized controls for better reachability. The interface is now cleaner and more intuitive.\n\nCompetition Mode Redesign: Simplified the entire page with a more focused design. Username entry is now easier, and we've added a motivating tagline: 'Answer Faster... Dominate the Fleet' to get users pumped for competition.\n\nLeaderboard Revolution: Implemented smooth infinite scrolling! No more cramped views - rankings now load progressively as you scroll, making the page faster and much easier to browse. You can now clearly see where you stand among the fleet.\n\nAbout Page Optimization: Trimmed down to essential information only, making it quicker to find what you need.\n\nThese improvements came directly from user feedback during testing. The app now feels more polished and professional, especially on mobile devices where most cadets will be using it. Next up: expanding the flag database and implementing the spaced repetition learning algorithm!",
          "tags": [
            "milestone",
            "design",
            "feature"
          ],
          "status": "published",
          "images": []
        },
        {
          "id": "major-scope-change-v03",
          "title": "Signals Master: Complete Platform Transformation",
          "date": "2025-12-10",
          "excerpt": "After presenting this application to my supervisor at a cadet unit and receiving detailed feedback, Signals Master is undergoing a complete transformation from a general quiz app to a comprehensive cadet training and examination platform focused on INTERCO pennants.",
          "content": "Big news! Following successful testing with friends, family, and initial feedback from a local cadet organization, I pitched Signals Master to my supervisor. The response? A complete scope change that transforms this from a simple quiz app into an official cadet training and examination system.\n\n**The Feedback That Changed Everything**\n\nMy supervisor identified the core requirements:\n- 80% focus on INTERCO pennants specifically\n- 90% coverage of letters and numbers (A-Z, 0-9)\n- Need for formal examination with pass/fail tracking (80% threshold)\n- Official record-keeping for cadet progression\n- Administrative oversight capabilities\n\n**What's Changing**\n\nThis isn't just an update—it's a complete platform redesign organized into four major initiatives:\n\n**Initiative 1: Platform Foundation (Weeks 1-2)**\nReplacing the name-only system with full user authentication. Every cadet will now register with their rank and name, creating individual accounts that track their entire learning journey. Simultaneously, all military flag data is being replaced with accurate INTERCO pennant meanings—26 letter flags, 10 number pennants, and special signals.\n\n**Initiative 2: Learning Tools (Weeks 3-4)**\nThe Practice Quiz is getting a major upgrade. Instead of just showing scores, it will now track every cadet's history, display progression charts, and show improvement trends over time. Alongside this, I'm building an Interactive Study Guide—a comprehensive reference with all INTERCO flags that cadets can browse, filter, and search before taking their exams.\n\n**Initiative 3: Official Examination System (Weeks 5-8)**\nThis is the game-changer. I'm building a formal examination module where cadets identify pennants from images (no time pressure—accuracy is what matters). The system will track pass/fail results based on the 80% threshold and maintain permanent records. Supervisors get a complete Administrative Dashboard to monitor all cadet progress, view exam results, filter by rank or status, and export official records.\n\n**Initiative 4: Launch Readiness (Week 9)**\nComprehensive testing with real cadets, documentation for both users and admins, and deployment preparation to ensure the platform is reliable and ready for official use.\n\n**Why This Matters**\n\nSignals Master is evolving from a learning tool into an institutional platform. It will enable the cadet corps to:\n- Standardize INTERCO pennant training\n- Track individual cadet progression\n- Conduct official evaluations with permanent records\n- Ensure every cadet meets the required proficiency standards\n\n**The Technical Challenge**\n\nThis transformation involves building:\n- Complete user authentication and profile system\n- Database restructuring for INTERCO-specific data\n- Progress tracking and analytics\n- Formal examination engine with randomized flag distribution\n- Administrative dashboard with reporting capabilities\n- Export functionality for official documentation\n\nI'm managing this in Linear with 8 major projects, 4 initiatives, and detailed issue tracking to keep everything organized. The 9-week timeline is ambitious, but the impact will be worth it.\n\n**What's Next**\n\nStarting with the foundation: user authentication and INTERCO data migration. Follow along as Signals Master transforms into a comprehensive cadet training platform. The Competitive Quiz fate is still being decided—it may be updated or replaced entirely depending on how the formal examination module evolves.\n\nThis is no longer just a side project—it's becoming an official tool for cadet training and evaluation. Let's build something that makes a real difference.",
          "tags": [
            "milestone",
            "major-update",
            "scope-change",
            "cadet-training"
          ],
          "status": "published",
          "images": []
        }
      ]
    },
    {
      "id": "2",
      "title": "Cadet Inventory Management System",
      "summary": "A professional enterprise-style web application designed to manage inventory, loan requests, and logistics",
      "detailedSummary": "A professional, enterprise-style web application designed to manage inventory, loan requests, and logistics for a cadet organization. Provides a structured, multi-role access model to ensure efficient operations.",
      "startDate": "2025-09-30",
      "expectedEndDate": "2026-03-31",
      "status": "planning",
      "technologies": [
        "Spring Boot",
        "H2-Database",
        "Angular",
        "PrimeNG",
        "Tailwind CSS"
      ],
      "repository": "",
      "liveUrl": "",
      "devlogPosts": []
    }
  ]
}
